FemDesign.Materials.TimberPanelType
timber_application_data

FemDesign.Materials.TimberPanelType._timberFactors
factors

FemDesign.Materials.TimberPanelType.PanelType
Can be either timberPanelLibraryData, glcDataLibraryType, cltDataLibraryType

FemDesign.Materials.TimberPanelType._shearCoupling
shear_coupling

FemDesign.Materials.TimberPanelType._gluedNarrowSides
glued_narrow_sides

FemDesign.Materials.TimberPanelType.#ctor(FemDesign.Materials.CltPanelLibraryType,FemDesign.Materials.TimberFactors,System.Boolean,System.Boolean)
Create a TimberPlateMaterial
cltPanelLibraryType:
factors: TimberFactors
shearCoupling: Consider shear coupling between layers
gluedNarrowSides: Glue at narrow sides